
## :x: Apply Failed

[CI link](https://github.com/malachowski-labs/infrastructure/actions/runs/22578400574)



<pre><code>Error: Error creating WorkloadIdentityPool: googleapi: Error 409: Requested entity already exists

  with google_iam_workload_identity_pool.kubernetes,
  on external-secret-operator.tf line 38, in resource &#34;google_iam_workload_identity_pool&#34; &#34;kubernetes&#34;:
  38: resource &#34;google_iam_workload_identity_pool&#34; &#34;kubernetes&#34; {


Error: error during placement (resource_unavailable, d2939a7db58fac774630dcbbe4902db4)

  with module.talos.hcloud_server.control_planes[&#34;control-plane-1&#34;],
  on .terraform/modules/talos/server.tf line 103, in resource &#34;hcloud_server&#34; &#34;control_planes&#34;:
 103: resource &#34;hcloud_server&#34; &#34;control_planes&#34; {

::error::OpenTofu exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

:warning: **The content is omitted as it is too long.** :warning:

```hcl
module.talos.data.hcloud_image.x86[0]: Reading...
module.talos.data.hcloud_locations.all: Reading...
data.cloudflare_zone.this: Reading...
data.google_secret_manager_secret_version.argocd_github_oauth_config: Reading...
data.google_secret_manager_secret_version.argocd_app_pem_key: Reading...
module.talos.data.hcloud_image.x86[0]: Read complete after 1s
module.talos.data.hcloud_locations.all: Read complete after 1s [id=7c4a8d09ca3762af61e59520943dc26494f8941b]
module.talos.data.hcloud_location.selected: Reading...
module.talos.data.hcloud_location.selected: Read complete after 0s [name=hel1]
data.google_secret_manager_secret_version.argocd_app_pem_key: Read complete after 0s [id=projects/671067631752/secrets/argocd-gh-app-pem-key/versions/1]
data.google_secret_manager_secret_version.argocd_github_oauth_config: Read complete after 0s [id=projects/671067631752/secrets/argocd-github-oauth/versions/1]
module.talos.data.helm_template.hcloud_ccm[0]: Reading...
module.talos.data.helm_template.cilium_default[0]: Reading...
module.talos.data.helm_template.hcloud_ccm[0]: Read complete after 1s [id=hcloud-cloud-controller-manager]
module.talos.data.kubectl_file_documents.hcloud_ccm[0]: Reading...
module.talos.data.kubectl_file_documents.hcloud_ccm[0]: Read complete after 0s [id=fd75f93c67322d92f1a716af4d0e4aac5647ad80625a969d3f152dcaa9d75118]
module.talos.data.helm_template.cilium_default[0]: Read complete after 1s [id=cilium]
module.talos.data.kubectl_file_documents.cilium[0]: Reading...
module.talos.data.kubectl_file_documents.cilium[0]: Read complete after 0s [id=c59f2d610804ad1ab424358ff3a06838e7d94e803d0aa990046d71655b9b5ff0]
data.cloudflare_zone.this: Read complete after 3s [id=aff336ce5012d1e29eb613ba0ec54d9a]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # cloudflare_dns_record.this will be created
  + resource "cloudflare_dns_record" "this" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "malachowski.me"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "aff336ce5012d1e29eb613ba0ec54d9a"
    }

  # cloudflare_dns_record.wildcard will be created
  + resource "cloudflare_dns_record" "wildcard" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "*.malachowski.me"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "aff336ce5012d1e29eb613ba0ec54d9a"
    }

  # google_iam_workload_identity_pool.kubernetes will be created
  + resource "google_iam_workload_identity_pool" "kubernetes" {
      + description               = "Workload Identity Pool for Kubernetes cluster"
      + disabled                  = false
      + display_name              = "Kubernetes Workload Identity"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "malachowski"
      + state                     = (known after apply)
      + workload_identity_pool_id = "kubernetes"
    }

  # google_iam_workload_identity_pool_provider.kubernetes_oidc will be created
  + resource "google_iam_workload_identity_pool_provider" "kubernetes_oidc" {
      + attribute_condition                = "assertion.sub.startsWith('system:serviceaccount:external-secrets:')"
      + attribute_mapping                  = {
          + "attribute.kubernetes_namespace" = "assertion['kubernetes.io'].namespace"
          + "attribute.kubernetes_pod"       = "assertion['kubernetes.io'].pod.name"
          + "attribute.kubernetes_sa"        = "assertion['kubernetes.io'].serviceaccount.name"
          + "google.subject"                 = "assertion.sub"
        }
      + description                        = "OIDC provider for Kubernetes service accounts"
      + disabled                           = false
      + display_name                       = "Kubernetes OIDC Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "malachowski"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "kubernetes"
      + workload_identity_pool_provider_id = "kubernetes-oidc-provider"

      + oidc {
          + issuer_uri = "https://oidc.malachowski.me"
        }
    }

  # google_project_iam_member.external_secrets_secret_accessor will be created
  + resource "google_project_iam_member" "external_secrets_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:external-secrets-operator@malachowski.iam.gserviceaccount.com"
      + project = "malachowski"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.external_secrets_secret_accessor_wif will be created
  + resource "google_project_iam_member" "external_secrets_secret_accessor_wif" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "malachowski"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_service_account.external_secrets will be created
  + resource "google_service_account" "external_secrets" {
      + account_id   = "external-secrets-operator"
      + description  = "Service Account used by External Secrets Operator via Workload Identity Federation"
      + disabled     = false
      + display_name = "External Secrets Operator Service Account"
      + email        = "external-secrets-operator@malachowski.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:external-secrets-operator@malachowski.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "malachowski"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.workload_identity_binding will be created
  + resource "google_service_account_iam_member" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # hcloud_load_balancer.this will be created
  + resource "hcloud_load_balancer" "this" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = (known after apply)
      + load_balancer_type = "lb11"
      + location           = "hel1"
      + name               = "prod-malachowski-me-lb"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)

      + algorithm (known after apply)

      + target (known after apply)
    }

  # hcloud_load_balancer_network.this will be created
  + resource "hcloud_load_balancer_network" "this" {
      + enable_public_interface = true
      + id                      = (known after apply)
      + ip                      = (known after apply)
      + load_balancer_id        = (known after apply)
      + network_id              = (known after apply)
    }

  # hcloud_load_balancer_target.this will be created
  + resource "hcloud_load_balancer_target" "this" {
      + id               = (known after apply)
      + label_selector   = "role=control-plane"
      + load_balancer_id = (known after apply)
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "7.7.11"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.external_secrets will be created
  + resource "helm_release" "external_secrets" {
      + atomic                     = false
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets"
      + namespace                  = "external-secrets"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "installCRDs": true
                "serviceAccount":
                  "create": false
                  "name": "external-secrets-operator"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.3.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubectl_manifest.cluster_config will be created
  + resource "kubectl_manifest" "cluster_config" {
      + api_version             = "argoproj.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Application"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cluster-config"
      + namespace               = "argocd"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: argoproj.io/v1alpha1
            kind: Application
            metadata:
              name: cluster-config
              namespace: argocd
            spec:
              destination:
                server: https://kubernetes.default.svc
              project: default
              source:
                directory:
                  recurse: true
                path: clusters/prod.malachowski.me
                repoURL: https://github.com/malachowski-labs/manifests
                targetRevision: HEAD
              syncPolicy:
                automated:
                  prune: true
                  selfHeal: true
                syncOptions:
                - ServerSideApply=true
                - CreateNamespace=true
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.secret_store_gcp will be created
  + resource "kubectl_manifest" "secret_store_gcp" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.traefik will be created
  + resource "kubectl_manifest" "traefik" {
      + api_version             = "argoproj.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Application"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "traefik"
      + namespace               = "argocd"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: argoproj.io/v1alpha1
            kind: Application
            metadata:
              name: traefik
              namespace: argocd
            spec:
              destination:
                server: https://kubernetes.default.svc
              project: default
              source:
                helm:
                  values: |2
                                logs:
                                  general:
                                    format: json
                                    level: INFO
                                  access:
                                    format: json
                                    enabled: true
                                    fields:
                                      general:
                                        defaultmode: keep
                                      headers:
                                        defaultmode: keep
                                metrics:
                                  prometheus:
                                    serviceMonitor:
                                      enabled: true
                                      additionalLabels:
                                        release: kube-prometheus-stack
                                service:
                                  annotations:
                                    load-balancer.hetzner.cloud/location: hel1
                                    load-balancer.hetzner.cloud/name: prod-malachowski-me-lb
                                    load-balancer.hetzner.cloud/use-private-ip: "true"
                                    load-balancer.hetzner.cloud/uses-proxyprotocol: "true"
                                ports:
                                  web:
                                    proxyProtocol:
                                      trustedIPs:
                                        - 127.0.0.1/32
                                        - 10.0.0.0/8
                                  websecure:
                                    proxyProtocol:
                                      trustedIPs:
                                        - 127.0.0.1/32
                                        - 10.0.0.0/8
                path: traefik
                repoURL: https://github.com/traefik/traefik-helm-chart.git
                targetRevision: v38.0.2
              syncPolicy:
                automated:
                  prune: true
                  selfHeal: true
                syncOptions:
                - CreateNamespace=true
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_cluster_role_binding_v1.oidc_jwks_anonymous will be created
  + resource "kubernetes_cluster_role_binding_v1" "oidc_jwks_anonymous" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "system:service-account-issuer-discovery-anonymous"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "system:service-account-issuer-discovery"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "system:unauthenticated"
          + namespace = "default"
        }
    }

  # kubernetes_config_map_v1.oidc_discovery will be created
  + resource "kubernetes_config_map_v1" "oidc_discovery" {
      + data = {
          + "openid-configuration" = jsonencode(
                {
                  + id_token_signing_alg_values_supported = [
                      + "RS256",
                    ]
                  + issuer                                = "https://oidc.malachowski.me"
                  + jwks_uri                              = "https://oidc.malachowski.me/openid/v1/jwks"
                  + response_types_supported              = [
                      + "id_token",
                    ]
                  + subject_types_supported               = [
                      + "public",
                    ]
                }
            )
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "oidc-discovery"
          + namespace        = "oidc-discovery"
          + resource_version = (known after apply)
        

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

t
              - list
              - watch
            - apiGroups:
              - cilium.io
              resources:
              - ciliumpodippools
              verbs:
              - create
            - apiGroups:
              - cilium.io
              resources:
              - ciliumloadbalancerippools/status
              verbs:
              - patch
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - create
              - get
              - update
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cilium-config-agent"] will be created
  + resource "kubectl_manifest" "apply_cilium" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "RoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cilium-config-agent"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              labels:
                app.kubernetes.io/part-of: cilium
              name: cilium-config-agent
              namespace: kube-system
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: cilium-config-agent
            subjects:
            - kind: ServiceAccount
              name: cilium
              namespace: kube-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cilium-config-agent"] will be created
  + resource "kubectl_manifest" "apply_cilium" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Role"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cilium-config-agent"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              labels:
                app.kubernetes.io/part-of: cilium
              name: cilium-config-agent
              namespace: kube-system
            rules:
            - apiGroups:
              - ""
              resources:
              - configmaps
              verbs:
              - get
              - list
              - watch
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_hcloud_ccm["/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager"] will be created
  + resource "kubectl_manifest" "apply_hcloud_ccm" {
      + api_version             = "v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ServiceAccount"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "hcloud-cloud-controller-manager"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: ServiceAccount
            metadata:
              name: hcloud-cloud-controller-manager
              namespace: kube-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"] will be created
  + resource "kubectl_manifest" "apply_hcloud_ccm" {
      + api_version             = "apps/v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "hcloud-cloud-controller-manager"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              name: hcloud-cloud-controller-manager
              namespace: kube-system
            spec:
              replicas: 1
              revisionHistoryLimit: 2
              selector:
                matchLabels:
                  app.kubernetes.io/instance: hcloud-cloud-controller-manager
                  app.kubernetes.io/name: hcloud-cloud-controller-manager
              template:
                metadata:
                  labels:
                    app.kubernetes.io/instance: hcloud-cloud-controller-manager
                    app.kubernetes.io/name: hcloud-cloud-controller-manager
                spec:
                  containers:
                  - args:
                    - --allow-untagged-cloud
                    - --cloud-provider=hcloud
                    - --feature-gates=CloudControllerManagerWatchBasedRoutesReconciliation=true
                    - --route-reconciliation-period=30s
                    - --webhook-secure-port=0
                    - --allocate-node-cidrs=true
                    - --cluster-cidr=10.0.16.0/20
                    - --leader-elect=false
                    env:
                    - name: HCLOUD_TOKEN
                      valueFrom:
                        secretKeyRef:
                          key: token
                          name: hcloud
                    - name: ROBOT_PASSWORD
                      valueFrom:
                        secretKeyRef:
                          key: robot-password
                          name: hcloud
                          optional: true
                    - name: ROBOT_USER
                      valueFrom:
                        secretKeyRef:
                          key: robot-user
                          name: hcloud
                          optional: true
                    - name: HCLOUD_NETWORK
                      valueFrom:
                        secretKeyRef:
                          key: network
                          name: hcloud
                    image: docker.io/hetznercloud/hcloud-cloud-controller-manager:v1.30.1
                    name: hcloud-cloud-controller-manager
                    ports:
                    - containerPort: 8233
                      name: metrics
                    resources:
                      requests:
                        cpu: 100m
                        memory: 50Mi
                  dnsPolicy: Default
                  hostNetwork: true
                  priorityClassName: system-cluster-critical
                  serviceAccountName: hcloud-cloud-controller-manager
                  tolerations:
                  - effect: NoSchedule
                    key: node.cloudprovider.kubernetes.io/uninitialized
                    value: "true"
                  - key: CriticalAddonsOnly
                    operator: Exists
                  - effect: NoSchedule
                    key: node-role.kubernetes.io/master
                    operator: Exists
                  - effect: NoSchedule
                    key: node-role.kubernetes.io/control-plane
                    operator: Exists
                  - effect: NoExecute
                    key: node.kubernetes.io/not-ready
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted"] will be created
  + resource "kubectl_manifest" "apply_hcloud_ccm" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "system:hcloud-cloud-controller-manager:restricted"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: system:hcloud-cloud-controller-manager:restricted
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: system:hcloud-cloud-controller-manager
            subjects:
            - kind: ServiceAccount
              name: hcloud-cloud-controller-manager
              namespace: kube-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager"] will be created
  + resource "kubectl_manifest" "apply_hcloud_ccm" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = true
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "system:hcloud-cloud-controller-manager"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              name: system:hcloud-cloud-controller-manager
            rules:
            - apiGroups:
              - ""
              resources:
              - configmaps
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - events
              verbs:
              - create
              - patch
              - update
            - apiGroups:
              - ""
              resources:
              - nodes
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - nodes/status
              verbs:
              - patch
            - apiGroups:
              - ""
              resources:
              - services
              verbs:
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - services/status
              verbs:
              - patch
              - update
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              verbs:
              - create
            - apiGroups:
              - ""
              resources:
              - persistentvolumes
              verbs:
              - get
              - list
              - update
              - watch
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - create
              - get
              - list
              - watch
              - update
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.talos.talos_cluster_kubeconfig.this[0] will be created
  + resource "talos_cluster_kubeconfig" "this" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = (known after apply)
      + endpoint                        = (known after apply)
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = (known after apply)
    }

  # module.talos.talos_machine_bootstrap.this[0] will be created
  + resource "talos_machine_bootstrap" "this" {
      + client_configuration = (known after apply)
      + endpoint             = (known after apply)
      + id                   = (known after apply)
      + node                 = (known after apply)
    }

  # module.talos.talos_machine_secrets.this will be created
  + resource "talos_machine_secrets" "this" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.12.0"
    }

  # module.talos.tls_private_key.ssh_key[0] will be created
  + resource "tls_private_key" "ssh_key" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 60 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kubeconfig = (sensitive value)
hcloud_load_balancer.this: Creating...
module.talos.talos_machine_secrets.this: Creating...
module.talos.hcloud_placement_group.worker: Creating...
module.talos.tls_private_key.ssh_key[0]: Creating...
module.talos.hcloud_network.this: Creating...
module.talos.hcloud_primary_ip.control_plane_ipv4[0]: Creating...
module.talos.hcloud_placement_group.control_plane: Creating...
module.talos.hcloud_floating_ip.control_plane_ipv4[0]: Creating...
module.talos.hcloud_firewall.this[0]: Creating...
module.talos.tls_private_key.ssh_key[0]: Creation complete after 0s [id=0a6780652a7c099e5bca8bcccf9554a55c5ff464]
module.talos.hcloud_ssh_key.this: Creating...
google_service_account.external_secrets: Creating...
module.talos.hcloud_ssh_key.this: Creation complete after 0s [id=108423833]
google_iam_workload_identity_pool.kubernetes: Creating...
module.talos.hcloud_placement_group.worker: Creation complete after 0s [id=1483682]
module.talos.hcloud_primary_ip.control_plane_ipv4[0]: Creation complete after 0s [id=120374990]
module.talos.hcloud_placement_group.control_plane: Creation complete after 0s [id=1483683]
module.talos.hcloud_floating_ip.control_plane_ipv4[0]: Creation complete after 0s [id=120374989]
module.talos.hcloud_network.this: Creation complete after 0s [id=11993440]
module.talos.data.hcloud_floating_ip.control_plane_ipv4[0]: Reading...
module.talos.hcloud_network_subnet.nodes: Creating...
module.talos.hcloud_firewall.this[0]: Creation complete after 1s [id=10623530]
module.talos.data.hcloud_floating_ip.control_plane_ipv4[0]: Read complete after 1s [name=control-plane-ipv4]
module.talos.hcloud_network_subnet.nodes: Creation complete after 1s [id=11993440-10.0.1.0/24]
hcloud_load_balancer.this: Creation complete after 1s [id=5900247]
hcloud_load_balancer_network.this: Creating...
cloudflare_dns_record.this: Creating...
cloudflare_dns_record.wildcard: Creating...
cloudflare_dns_record.wildcard: Creation complete after 0s [id=4b3724dafc9414544d524d5b861ba4f6]
cloudflare_dns_record.this: Creation complete after 0s [id=12d50b9163e77bae9c659628634e34f2]
module.talos.talos_machine_secrets.this: Creation complete after 2s [id=machine_secrets]
module.talos.data.talos_client_configuration.this: Reading...
module.talos.data.talos_client_configuration.this: Read complete after 0s [id=prod.malachowski.me]
module.talos.data.talos_machine_configuration.control_plane["control-plane-1"]: Reading...
module.talos.data.talos_machine_configuration.control_plane["control-plane-1"]: Read complete after 0s [id=prod.malachowski.me]
module.talos.hcloud_server.control_planes["control-plane-1"]: Creating...
google_service_account.external_secrets: Still creating... [10s elapsed]
hcloud_load_balancer_network.this: Still creating... [10s elapsed]
google_service_account.external_secrets: Creation complete after 12s [id=projects/malachowski/serviceAccounts/external-secrets-operator@malachowski.iam.gserviceaccount.com]
google_project_iam_member.external_secrets_secret_accessor: Creating...
hcloud_load_balancer_network.this: Creation complete after 16s [id=5900247-11993440]
hcloud_load_balancer_target.this: Creating...
hcloud_load_balancer_target.this: Creation complete after 1s [id=lb-label-selector-tgt-4d396b0b323f9a09cabdc6d7bb8917e3f54c1d8b9343f926bfde69afb3209a9e-5900247]
google_project_iam_member.external_secrets_secret_accessor: Creation complete after 7s [id=malachowski/roles/secretmanager.secretAccessor/serviceAccount:external-secrets-operator@malachowski.iam.gserviceaccount.com]

Error: Error creating WorkloadIdentityPool: googleapi: Error 409: Requested entity already exists

  with google_iam_workload_identity_pool.kubernetes,
  on external-secret-operator.tf line 38, in resource "google_iam_workload_identity_pool" "kubernetes":
  38: resource "google_iam_workload_identity_pool" "kubernetes" {


Error: error during placement (resource_unavailable, d2939a7db58fac774630dcbbe4902db4)

  with module.talos.hcloud_server.control_planes["control-plane-1"],
  on .terraform/modules/talos/server.tf line 103, in resource "hcloud_server" "control_planes":
 103: resource "hcloud_server" "control_planes" {

::error::OpenTofu exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"infra-apply","PRNumber":20,"Program":"tfcmt","SHA1":"09bab509d48e0817a6e824ed34078d1a886830b4","Vars":{},"WorkflowName":"infra-apply"} -->